Revit 2027 API
DirectContext3DHandleOverrides.GetDirectContext3DHandleSettings Method
 Gets override settings associated with a DirectContext3D handle instance or type.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectContext3DHandleSettings GetDirectContext3DHandleSettings(
	Document aDoc,
	ElementId elementId
)
Public Function GetDirectContext3DHandleSettings (
	aDoc As Document,
	elementId As ElementId
) As DirectContext3DHandleSettings
public:
DirectContext3DHandleSettings^ GetDirectContext3DHandleSettings(
	Document^ aDoc,
	ElementId^ elementId
)
member GetDirectContext3DHandleSettings :
        aDoc : Document *
        elementId : ElementId -> DirectContext3DHandleSettings
Parameters
aDoc Document
 Document where elementId resides.
elementId ElementId
 Id of the overridden element.
Return Value
DirectContext3DHandleSettings
 The override settings assigned to the handle element, if present, or a default override settings if nothing was found.
Exceptions
Exception | Condition
ArgumentException |  The ElementId elementId is not a valid DirectContext3D handle instance or type.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DHandleOverrides Class
Autodesk.Revit.DB.DirectContext3D Namespace